import styles from "../stylesheets/Home.module.css";
import img from "../assets/story_scene.jpg";

export const Home = () => {
    return(
        <>
        <div className={styles.first}>

        </div>
        <div className={styles.second}>
            <p>『秒速5センチメートル』（07年）、『言の葉の庭』（13年）など</p>
            <p>意欲的な作品を数多く作り出してきた気鋭のアニメーション映画監督・新海誠。</p>
            <p>精緻な風景描写とすれ違う男女の物語を、美しい色彩と繊細な言葉によって紡ぎ出す“新海ワールド”は、</p>
            <p>世代や業界、国内外を問わず人々に大きな刺激と影響をおよぼしてきた。</p>
            <p>新海誠監督の待望の新作となる『君の名は。』は、夢の中で“入れ替わる”少年と少女の恋と奇跡の物語。</p>
            <p>世界の違う二人の隔たりと繋がりから生まれる「距離」のドラマを圧倒的な映像美とスケールで描き出す。</p>
            <p>作画監督を務めるのは『千と千尋の神隠し』（01年）など</p>
            <p>数多くのスタジオジブリ作品を手掛けた、アニメーション界のレジェンド、安藤雅司。</p>
            <p>また、『心が叫びたがってるんだ。』（15年）などで新時代を代表するアニメーターとなった</p>
            <p>田中将賀をキャラクターデザインに迎えるなど、日本最高峰のスタッフがスタジオに集結した。</p>
            <p>そして、主題歌を含む音楽は、その唯一無二の世界観と旋律で熱狂的な支持を集めるロックバンド・RADWIMPSが担当する。</p>
            <p>声の出演として、三葉が夢の中で見た男の子・瀧役に同世代の中でひときわ異彩を放つ演技派俳優、神木隆之介。</p>
            <p>また、自らの運命に翻弄されていくヒロイン・三葉役を、オーディションでその役を射止めた上白石萌音。</p>
            <p>更には長澤まさみ、市原悦子ほかアニメーションと実写の垣根を越えたまさに豪華キャスティングが実現した。</p>
            <br></br>
            <br></br>
            <h1>誰もが経験したことのない、アニメーションの新領域。</h1>
            <h1>新たな“不朽の名作”が誕生する！</h1>
        </div>
        <div className={styles.third}>
            <div className={styles.scene}><img src={img}></img></div>
            <div className={styles.story}>
                <b> S t o r y</b>
                <br></br>
                <br></br>
                <br></br>
                <br></br>
                <p>千年ぶりとなる彗星の来訪を一か月後に控えた日本。</p>
                <p>山深い田舎町に暮らす女子高校生・三葉は憂鬱な毎日を過ごしていた。</p>
                <p>町長である父の選挙運動に、家系の神社の古き風習。</p>
                <p>小さく狭い町で、周囲の目が余計に気になる年頃だけに、都会への憧れを強くするばかり。</p>
                <br></br>
                <h1>「来世は東京のイケメン男子にしてくださーい！！！」</h1>
                <br></br>
                <p>そんなある日、自分が男の子になる夢を見る。</p>
                <p>見覚えのない部屋、見知らぬ友人、目の前に広がるのは東京の街並み。</p>
                <p>念願だった都会での生活を思いっきり満喫する三葉。</p>
                <br></br>
                <p>一方、東京で暮らす男子高校生、瀧も、奇妙な夢を見た。</p>
                <p>行ったこともない山奥の町で、自分が女子高校生になっているのだ。</p>
                <br></br>
                <p>繰り返される不思議な夢。そして、明らかに抜け落ちている、記憶と時間。</p>
                <p>二人は気付く。</p>
                <br></br>
                <h1>「私／俺たち、入れ替わってる！？」</h1>
                <br></br>
                <p>いく度も入れ替わる身体とその生活に戸惑いながらも、現実を少しずつ受け止める瀧と三葉。</p>
                <p>残されたお互いのメモを通して、時にケンカし、時に相手の人生を楽しみながら</p>
                <p>しかし、気持ちが打ち解けてきた矢先、突然入れ替わりが途切れてしまう。</p>
                <p>入れ替わりながら、同時に自分たちが特別に繋がっていたことに気付いた瀧は</p>
                <p>、三葉に会いに行こうと決心する。</p>
                <p>、状況を乗り切っていく。</p>
                <br></br>
                <h1>「まだ会ったことのない君を、これから俺は探しに行く。」</h1>
                <br></br>
                <p>辿り着いた先には、意外な真実が待ち受けていた……。</p>
                <br></br>
                <br></br>
                <h1>出会うことのない二人の出逢い。</h1>
                <h1>運命の歯車が、いま動き出す</h1>
            </div>
        </div>
        <div className={styles.fourth}>
            <h1>S T A F F</h1>
            <div className={styles.profilepic}></div>
            <h1>監督新海しんかい誠まこと</h1>
            <br></br>
            <br></br>
            <br></br>
            <br></br>   
            <p className={styles.picstext}>1973年生まれ、長野県出身。2002年、個人で制作した短編作品「ほしのこえ」でデビュー。同作品は、新世紀東京国際アニメフェア21「公募部門優秀賞」をはじめ多数の賞を受賞。2004年公開の初の長編映画『雲のむこう、約束の場所』では、その年の名だたる大作をおさえ、第59回毎日映画コンクール「アニメーション映画賞」を受賞。2007年公開の『秒速5センチメートル』で、アジアパシフィック映画祭「最優秀アニメ賞」、イタリアのフューチャーフィルム映画祭で「ランチア・プラチナグランプリ」を受賞。2011年に全国公開された『星を追う子ども』では、これまでとは違う新たな作品世界を展開、第八回中国国際動漫節「金猴賞」優秀賞受賞。2012年、内閣官房国家戦略室より「世界で活躍し『日本』を発信する日本人」として感謝状を受賞。2013年に公開された『言の葉の庭』では、自身最大のヒットを記録。ドイツのシュトゥットガルト国際アニメーション映画祭にて長編アニメーション部門のグランプリを受賞した。同年、信毎選賞受賞。次世代の監督として、国内外で高い評価と支持を受けている。</p>
            <br></br>
            <br></br>
            <div className={styles.bttn}>
                <div className={styles.btn}>新海誠監督作品ポータルサイト</div>
                <br></br>
                <div className={styles.btn}>これまでの監督作品</div>
            </div>
            <div className={styles.bttn1}>INTERVIEW</div>
            <br></br>
            <br></br>
            <br></br>
            <br></br>
            <h1>作画監督安藤あんどう雅司</h1>
            <br></br>
            <br></br>
            <br></br>
            <br></br>
            <p className={styles.picstext}>1969年生まれ、広島県出身。1990年、研修生の二期生としてスタジオジブリ入社。宮崎駿監督作品『もののけ姫』（97年）、『千と千尋の神隠し』（01年）で作画監督を務める。2003年、フリーになって以降もジブリ作品に参加するほか、今敏監督作品などで才能を発揮。『思い出のマーニー』（14年）で14年ぶりにジブリ作品の作画監督を務め、同作品では脚本も担当している。キャラクターデザイン・作画監督を務めた作品に、『パプリカ』（06年）、『ももへの手紙』（12年）、原画参加作品に、『イノセンス』（04年）、『ヱヴァンゲリヲン新劇場版:Q』（12年）などがある。</p>
            <div className={styles.bttn1}>INTERVIEW</div>
            <br></br>
            <br></br>
            <br></br>
            <br></br>
            <h1>キャラクターデザイン田中たなか将賀</h1>
            <br></br>
            <br></br>
            <br></br>
            <br></br>
            <p className={styles.picstext}>1976年生まれ、広島県出身。代々木アニメーション学院卒業後、アートランドを経て現在はフリー。「プリンセスナイン 如月女子高野球部」（98年）でアニメーターデビュー、「家庭教師ヒットマンREBORN！」（06年～10年）でキャラクターデザインを初担当。長井龍雪監督とのタッグのもと、「とらドラ」（08年～09年）、「あの日見た花の名前を僕達はまだ知らない。」（11年）、「あの夏で待ってる」（12年）でキャラクターデザイン・総作画監督を手掛け、一躍注目を集める。長井監督の最新作『心が叫びたがってるんだ。』（15年）でもキャラクターデザイン・総作画監督を担当。新海誠監督とはＺ会のCM作品「クロスロード」で初タッグ。近年ではイラストレーターとしても活躍している。</p>
            <div className={styles.bttn1}>INTERVIEW</div>
            <br></br>
            <br></br>
            <br></br>
            <br></br>
            <h1>音楽 RADWIMPS</h1>
            <br></br>
            <br></br>
            <br></br>
            <br></br>
            <p className={styles.picstext}>野田洋次郎（Vo./Gt./Pf.）, 桑原 彰（Gt.）, 武田祐介（Ba.）　2001年結成、2005年メジャーデビュー。ロック・ジャズ・ヒップホップから民族音楽まで縦横無尽に織りこまれ、「ジャンル」という既存の枠組にとらわれない音楽性。恋愛から死生観まで、哲学的、時にロマンティックに描き出した歌詞。大きなメディア露出がなかったにもかかわらず、ライブと口コミで着実に広がり、思春期を過ごす世代を中心に大きな支持を受けている。</p>
            <div className={styles.bttn1}>INTERVIEW</div>
        </div>
        <div className={styles.footer}>
            <br></br>
            <br></br>
            <h1>神木隆之介　上白石萌音</h1>
            <br></br>
            <h1>成田凌　悠木碧　島﨑信長　石川界人　谷花音</h1>
            <br></br>
            <h1>長澤まさみ　市原悦子</h1>
            <br></br>
            <p>原作・脚本・監督／新海誠　作画監督／安藤雅司　キャラクターデザイン／田中将賀　音楽／RADWIMPS</p>
            <br></br>
            <p>製作／市川南　川口典孝　大田圭二　共同製作／井上伸一郎　弓矢政法　畠中達郎　善木準二　坂本健　企画・プロデュース／川村元気　エグゼクティブプロデューサー／古澤佳寛　プロデューサー</p>
            <p>／武井克弘　伊藤耕一郎　制作プロデューサー／酒井雄一　音楽プロデューサー／成川沙世子　音響監督／山田陽　音響効果／森川永子</p>
            <br></br>
            <p>製作／「君の名は。」製作委員会（東宝　コミックス・ウェーブ・フィルム　KADOKAWA　ジェイアール東日本企画　アミューズ　voque ting　ローソンHMVエンタテイメント）制作／コミックス・ウェーブ・フィルム　配給／東宝　</p>
        </div>
        </>
    )
}